Repository: Kostenkov-2021/audacityAccessEnhancementNVDAAddon
Catalog: audacityAccessEnhancement-2.7/locale/*/LC_MESSAGES/nvda.po
Languages: tr

source: Audacity multi-track editor: accessibility enhancement
tr: Audacity çok kanallı editör: erişilebilirlik geliştirmeleri

source: This add-on adds extra functionality when working with Audacity * a script to report audio position, * a script to report start and end of selection, * a script to announce the state of the "Pause", "Play" and "record" buttons, * automatic audio position changes report , * automatic selection changes report (can be disabled), * timer control editting support, * use of spacebar to press a button, * script to report playback/recording peak level, * script to report playback/record slider level, * script to report playback speed, * script to display add-on user manual, * script to display audacity guide written by David Bailes. This addon's version has been tested with audacity 3.0.2, 3.0.0, 2.4.2, 2.4.1, 2.3.3 and 2.3.2. Previous versions of Audacity are not supported.
tr: Bu eklenti Audacity ile çalışırken ekstra işlevsellik ekler * ses konumunu bildiren bir komut, * seçimin başlangıcını ve sonunu bildiren bir komut, * "Duraklat", "Oynat" ve "kaydet" düğmelerinin durumunu bildiren bir komut, * otomatik ses konumu değişiklikleri bildirimi, * otomatik seçim değişiklikleri bildirimi (devre dışı bırakılabilir), * zamanlayıcı kontrolü düzenleme desteği, * bir düğmeye basmak için aralık tuşunun kullanılması, * oynatma / kayıt pik seviyesini bildiren komut, * oynatma / kayıt kaydırma seviyesini bildiren komut, * çalma hızını bildiren komut, * eklenti kullanım kılavuzunu görüntülemek için komut, * David Bailes tarafından yazılan audacity rehberini görüntülemek için komut. Eklentinin bu sürümü audacity 3.0.2, 3.0.0, 2.4.2, 2.4.1, 2.3.3 ve 2.3.2 ile test edilmiştir. Audacity'nin önceki sürümleri desteklenmez.

source: Do you want to keep current add-on configuration settings ?
tr: Eklentinin mevcut ayarlarını korumak istiyor musun?

source: %s - installation
tr: %s - Kurulumu

source: Informations
tr: Bilgiler

source: Co&py to Clipboard
tr: &Panoya kopyala

source: Copied
tr: Kopyalandı

source: Error, the information cannot be copied to the clipboard
tr: Hata, bilgiler panoya kopyalanamıyor

source: The add-on has not been tested with this version of Audacity and may not be compatible with it.
tr: Eklenti, Audacity'nin bu sürümüyle test edilmemiştir ve onunla uyumlu olmayabilir.

source: %s add-on - warning
tr: %s eklenti - uyarı

source: one day
tr: bir gün

source: %s days
tr: %s gün

source: one hour
tr: bir saat

source: %s hours
tr: %s saat

source: 1 minute
tr: 1 dakika

source: %s minutes
tr: %s dakika

source: 1 second {0}
tr: 1 saniye {0}

source: {0} seconds {1}
tr: {0} saniye {1}

source: 0 second %s
tr: 0 saniye %s

source: %s second
tr: %s saniye

source: 0 second
tr: 0 saniye

source: one sample
tr: bir örnek

source: %s samples
tr: %s örnek

source: 0 sample
tr: 0 örnek

source: Audio position at start of track
tr: Ses konumu parçanın başı

source: Audio position at selection's start
tr: Ses konumu seçim başlangıcında

source: Selection:
tr: Seçim:

source: no selection
tr: seçim yok

source: %s dialog is allready open
tr: %s iletişim kutusu zaten açık

source: {addonSummary}'s add-on - {dialogTitle}
tr: {addonSummary}'nin eklentisi - {dialogTitle}

source: Recording stopped
tr: Kayıt durdu

source: Recording
tr: Kayıt

source: %s not available
tr: %s mevcut değil

source: No track
tr: Parça yok

source: units of hours
tr: saat, birler basamağı

source: dozens of hours
tr: saat, onlar basamağı

source: units of minutes
tr: dakika, birler basamağı

source: dozens of minutes
tr: dakika, onlar basamağı

source: units of seconds
tr: saniye, birler basamağı

source: dozens of seconds
tr: saniye, onlar basamağı

source: hundreds of seconds
tr: saniye, yüzler basamağı

source: thounsands of seconds
tr: saniye, binler basamağı

source: tens thousands of seconds
tr: saniye, onbinler basamağı

source: hundreds thousands of seconds
tr: saniye, yüzbinler basamağı

source: tenths of seconds
tr: salise, onlar basamağı

source: hundredths of seconds
tr: salise, yüzler basamağı

source: thousandths of seconds
tr: salise, binler basamağı

source: units of days
tr: gün, birler basamağı

source: dozens of days
tr: gün, onlar basamağı

source: units
tr: birler

source: dozens
tr: onlar

source: hundreds
tr: yüzler

source: thousands
tr: binler

source: tens of thousands
tr: onbinler

source: hundreds of thousands
tr: yüzbinler

source: millions
tr: milyonlar

source: units of samples
tr: numune, birler basamağı

source: dozens of samples
tr: numune, onlar basamağı

source: hundreds of samples
tr: numune, yüzler basamağı

source: thounsands of samples
tr: numune, binler basamağı

source: tens thousands of samples
tr: numune, onbinler basamağı

source: hundreds thousands of samples
tr: numune, yüzbinler basamağı

source: hours
tr: saat

source: minutes
tr: dakika

source: seconds
tr: saniye

source: milliseconds
tr: milisaniye

source: days
tr: gün

source: samples
tr: örnekler

source: report position of start and end of the selection. Twice: report selection's length. Third: report position of selection's center
tr: seçimin başlangıç ve bitiş konumunu bildir. İki kez: seçimin uzunluğunu söyle. Üç kez: seçimin merkezini bildir.

source: Report position of start and end of the selection
tr: Seçim başlangıç ve bitiş konumlarını bildir

source: Report selection's length
tr: Seçimin uzunluğunu söyle

source: Report position of selection's center
tr: Seçim merkezinin konumunu bildir

source: report audio position
tr: ses konumunu bildir

source: Enable or disable automatic report of selection's changes
tr: Seçim değişikliklerinin otomatik bildirimini etkinleştir veya devre dışı bırak

source: report the pressed state of Pause , Play and Record buttons
tr: Duraklat, Oynat ve Kaydet düğmelerinin basılı durumunu bildir

source: Reports the current level of playback meter peak
tr: Geçerli oynatma ölçer tepe seviyesini göster

source: Reports the current recording meter peak level
tr: Geçerli kayıt ölçer tepe seviyesini bildir

source: Reports the current level of playback's slider
tr: Geçerli oynatma düzeyini bildir

source: Reports the current level of recording's slider
tr: Geçerli kayıt düzeyini bildir

source: Reports the current playback speed level
tr: Geçerli oynatma hızını bildir

source: Display add-on user manual
tr: Eklenti kullanım kılavuzunu görüntüle

source: Display audacity guide
tr: Audacity kılavuzunu görüntüle

source: Launch command shell
tr: Komut kabuğunu başlat

source: Display shell scripts's list
tr: komut kabuğu komutlarının listesini görüntüle

source: (command: %s)
tr: (komut: %s)

source: Report automaticaly selection's changes
tr: Seçim değişikliklerini otomatik olarak bildir

source: Don't report automaticaly selection change
tr: Seçim değişikliğini otomatik olarak bildirme

source: Not in tracks view
tr: Parça görünümünde değil

source: record button pressed
tr: kayıt düğmesi basılı

source: play button pressed
tr: oynat düğmesi basılı

source: Pause button pressed
tr: Duraklat düğmesi basılı

source: No button pressed
tr: Hiçbir düğmeye basılı değil

source: playback speed: %s
tr: çalma hızı: %s

source: Please wait ...
tr: Lütfen bekle...

source: Error: Add-on user manual is not found
tr: Hata: Eklenti kullanım kılavuzu bulunamadı

source: Error: audacity guide is not found
tr: Hata: audacity kılavuzu bulunamadı

source: Shell's scripts
tr: Komut kabuğu

source: scripts:
tr: komutlar:

source: &Run script
tr: Komutu çalıştı&r

source: Options
tr: Seçenekler

source: Use space bar and Enter keys to press button
tr: Düğmeye basmak için aralık çubuğunu ve Enter tuşlarını kullanın

source: Report toolbars's name
tr: Araç çubuklarını bildir

source: EnhancedAnnouncement of edit spin boxes
tr: Dönen yazı alanlarının gelişmiş anonsu

source: Update
tr: Güncelleme

source: Automatically check for &updates
tr: Güncellemeleri &otomatik olarak kontrol et

source: Update also release versions to &developpement versions
tr: Ana &sürümleri geliştirici sürümlerle de güncelle

source: &Check for update
tr: &Güncellemeleri denetle

source: View &history
tr: Geçmişi g&örüntüle

source: Settings
tr: Ayarlar

source: The update is not compatible with this version of NVDA. Minimum NVDA version: {minYear}.{minMajor}, last tested: {testedYear}.{testedMajor}.
tr: Güncelleme, NVDA'nın bu sürümüyle uyumlu değil. Minimum NVDA sürümü: {minYear}.{minMajor}, son sınama: {testedYear}.{testedMajor}.

source: Downloading {name}
tr: {name} indiriliyor

source: Error downloading update for {name}.
tr: Error downloading update for {name} İçin güncelleme indirilirken hata oluştu.

source: Cannot update {name} - missing file or invalid file format
tr: {name} güncellenemiyor - eksik dosya veya geçersiz dosya biçimi

source: Updating
tr: Güncelleniyor

source: Please wait while the add-on is being updated.
tr: Eklenti güncellenirken lütfen bekleyin.

source: Failed to update {name} add-on
tr: {name} eklenti Güncellemesi başarısız oldu

source: {summary} - update
tr: {summary} - Güncelleme

source: The service is temporarily under maintenance. Please, try again later.
tr: Hizmet geçici olarak bakımda. Lütfen daha sonra tekrar deneyin.

source: New version%s is available. Do you want to download it now?
tr: Yeni sürüm%s mevcut. Şimdi indirmek ister misiniz?

source: You are up-to-date. %s is the latest version.
tr: Güncelsin. %s en son sürümüdür.

source: Oops! There was a problem checking for updates. Please retry later
tr: Hata! Güncellemeler kontrol edilirken bir sorun oluştu. Lütfen daha sonra tekrar dene

source: &Yes
tr: &Evet

source: &No
tr: &Hayır

source: &Later
tr: &Sonra

source: Wha&t's new
tr: Ne &yeni
