Repository: Kostenkov-2021/audacityAccessEnhancementNVDAAddon
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: ar, it

source: Audacity multi-track editor: accessibility enhancement
ar: تحسين إمكانية الوصول:Audacity
it: Editor multitraccia Audacity: miglioramento dell'accessibilità

source: This add-on adds extra functionality when working with Audacity * a script to report audio position, * a script to report start and end of selection, * a script to announce the state of the "Pause", "Play" and "record" buttons, * automatic audio position changes report , * automatic selection changes report (can be disabled), * timer control editting support, * use of spacebar to press a button, * script to report playback/recording peak level, * script to report playback/record slider level, * script to report playback speed, * script to display add-on user manual, * script to display audacity guide written by David Bailes. This addon's version has been tested with audacity 2.4.2, 2.4.1, 2.3.3 and 2.3.2. Previous versions of Audacity are not supported.
ar: تضيف هذه الوظيفة الإضافية وظائف إضافية عند العمل مع Audacity * برنامج نصي للإبلاغ عن موقف الصوت، * برنامج نصي للإبلاغ عن بداية ونهاية الاختيار، * برنامج نصي للإعلان عن حالة أزرار" الإيقاف المؤقت "و" التشغيل "و" التسجيل"، * تقرير التغييرات موقف الصوت التلقائي ، * تقرير تغييرات الاختيار التلقائي (يمكن تعطيله) ، * دعم تحرير التحكم في المؤقت، * استخدام مفتاح المسافة للضغط على زر، * اختصار للإبلاغ عن تشغيل / تسجيل مستوى الذروة، * اختصار للإبلاغ عن تشغيل / تسجيل مستوى المنزلق، * اختصار للإبلاغ عن سرعة التشغيل، * النصي لعرض إضافة على دليل المستخدم، * سيناريو لعرض دليل جرأة كتبه ديفيد بايلز. تم اختبار إصدار هذا الملحق مع audacity 2.4.2 و 2.4.1 و 2.3.3 و 2.3.2. الإصدارات السابقة من Audacity غير مدعومة.

source: Do you want to keep current add-on configuration settings ?
ar: هل تريد الاحتفاظ بإعدادات تكوين الوظيفة الإضافية الحالية؟
it: Vuoi mantenere le impostazioni di configurazione del componente aggiuntivo correnti?

source: %s - installation
ar: %s - التثبيت
it: %s - installazione

source: Informations
ar: المعلومات
it: Informazioni

source: Co&py to Clipboard
ar: نسخ إلى الحافظة
it: Co&pia negli appunti

source: Copied
ar: نسخ
it: copiato

source: Error, the information cannot be copied to the clipboard
ar: خطأ ، لا يمكن نسخ المعلومات إلى الحافظة
it: Errore, le informazioni non possono essere copiate negli appunti

source: This version %s of Audacity is not compatible with the add-on
ar: هذا الإصدار %s من Audacity غير متوافق مع الوظيفة الإضافية

source: %s add-on - warning
ar: تحذير الوظيفة الإضافية - %s

source: one day
ar: يوما ما
it: un giorno

source: %s days
ar: %s يوم
it: %s giorni

source: one hour
ar: ساعة واحدة
it: un'ora

source: %s hours
ar: %s ساعة
it: %s ore

source: 1 minute
ar: 1 دقيقة
it: 1 minuto

source: %s minutes
ar: %s دقيقة
it: %s minuti

source: 1 second {0}
ar: ثانية واحدة {0}
it: un secondo {0}

source: {0} seconds {1}
ar: {0} ثواني {1}
it: {0} secondi {1}

source: 0 second %s
ar: 0 ثانية %s
it: 0 secondi %s

source: %s second
ar: %s ثانية
it: %s secondi

source: 0 second
ar: 0 ثانية
it: 0 secondi

source: one sample
ar: عينة واحدة
it: un campione

source: %s samples
ar: %s عينات
it: %s campioni

source: 0 sample
ar: 0 عينة
it: 0 campioni

source: Audio position at start of track
ar: وضع الصوت في بداية المسار
it: Posizione dell'audio all'inizio della traccia

source: Audio position at selection's start
ar: وضع الصوت في بداية التحديد
it: Posizione dell'audio all'inizio della selezione

source: Selection:
ar: اختيار:
it: Selezione:

source: no selection
ar: لا اختيار
it: nessuna selezione

source: %s dialog is allready open
ar: مربع حوار %s مفتوح بالفعل
it: La finestra di dialogo %s è già aperta

source: {addonSummary}'s add-on - {dialogTitle}
ar: ملخص {addonSummary}' الوظيفة الإضافية - {voiceTitle}
it: {addonSummary} - {dialogTitle}

source: Recording stopped
ar: توقف التسجيل
it: Registrazione interrotta

source: Recording
ar: تسجيل
it: Registrazione

source: %s not available
ar: %s غير متوفر
it: %s non disponibile

source: No track
ar: لا مسار
it: Nessuna traccia

source: units of hours
ar: وحدات الساعات
it: unità di ore

source: dozens of hours
ar: عشرات الساعات
it: decine di ore

source: units of minutes
ar: وحدات الدقائق
it: unità di minuti

source: dozens of minutes
ar: عشرات الدقائق
it: decine di minuti

source: units of seconds
ar: وحدات الثواني
it: unità di secondi

source: dozens of seconds
ar: عشرات الثواني
it: decine di secondi

source: hundreds of seconds
ar: مئات الثواني
it: centinaia di secondi

source: thounsands of seconds
ar: آلاف الثواني
it: migliaia di secondi

source: tens thousands of seconds
ar: عشرات الآلاف من الثواني
it: decine di migliaia di secondi

source: hundreds thousands of seconds
ar: مئات الآلاف من الثواني
it: centinaia di migliaia di secondi

source: tenths of seconds
ar: أعشار الثواني
it: decimi di secondo

source: hundredths of seconds
ar: مئات الثواني
it: centesimi di secondo

source: thousandths of seconds
ar: آلاف الثواني
it: millesimi di secondo

source: units of days
ar: وحدات الأيام
it: unità di giorni

source: dozens of days
ar: عشرات الأيام
it: decine di giorni

source: units
ar: الوحدات
it: unità

source: dozens
ar: العشرات
it: decine

source: hundreds
ar: المئات
it: centinaia

source: thousands
ar: آلاف
it: migliaia

source: tens of thousands
ar: عشرات الآلاف
it: decine di migliaia

source: hundreds of thousands
ar: مئات الآلاف
it: centinaia di migliaia

source: millions
ar: ملايين
it: milioni

source: units of samples
ar: وحدات العينات
it: unità di campioni

source: dozens of samples
ar: العشرات من العينات
it: decine di campioni

source: hundreds of samples
ar: مئات العينات
it: centinaia di campioni

source: thounsands of samples
ar: آلاف العينات
it: migliaia di campioni

source: tens thousands of samples
ar: عشرات الآلاف من العينات
it: decine di migliaia di campioni

source: hundreds thousands of samples
ar: مئات الآلاف من العينات
it: centinaia di migliaia di campioni

source: hours
ar: ساعات
it: ore

source: minutes
ar: الدقائق
it: minuti

source: thousands seconds
ar: آلاف الثواني
it: migliaia di secondi

source: seconds
ar: ثواني
it: secondi

source: hundredths seconds
ar: مئة ثانية
it: centesimi di secondo

source: milliseconds
ar: مللي ثانية
it: millisecondi

source: days
ar: أيام
it: giorni

source: thousand samples
ar: آلاف العينات
it: mila campioni

source: samples
ar: عينات
it: campioni

source: report position of start and end of the selection. Twice: report selection's length. Third: report position of selection's center
ar: الإبلاغ عن موضع بداية ونهاية التحديد. مرتين: طول الإبلاغ عن التحديد. ثلاث مرات: الإبلاغ عن موضع مركز الاختيار
it: annuncio della posizione di inizio e fine della selezione. Due volte: annunciare durata della selezione. Tre volte: annunciare la posizione del centro di selezione

source: Report position of start and end of the selection
ar: الإبلاغ عن موقف بداية ونهاية التحديد
it: Annuncia la posizione di inizio e fine della selezione

source: Report selection's length
ar: الإبلاغ عن طول التحديد
it: Annuncia la lunghezza della selezione

source: Report position of selection's center
ar: الإبلاغ عن إختيار موضع المنتصف
it: Annuncia la posizione del centro della selezione

source: report audio position
ar: الإبلاغ عن موضع الصوت
it: Annuncia la posizione dell'audio

source: Enable or disable automatic report of selection's changes
ar: تمكين أو تعطيل التقرير التلقائي لتغييرات التحديد
it: Abilita o disabilita l'annuncio automatico delle modifiche alla selezione

source: report the pressed state of Pause , Play and Record buttons
ar: الإبلاغ عن حالة الضغط على أزرار الإيقاف المؤقت والتشغيل والتسجيل
it: annuncia lo stato premuto dei pulsanti Pausa, Riproduci e Registra

source: Reports the current level of playback meter peak
ar: يبين المستوى الحالي لذروة عداد التشغيل
it: Annuncia il livello corrente del misuratore di picco di riproduzione

source: Reports the current recording meter peak level
ar: يبين مستوى ذروة عداد التسجيل الحالي
it: Annuncia il livello corrente del misuratore di picco di registrazione

source: Reports the current level of playback's slider
ar: يبين المستوى الحالي من شريط تمرير التشغيل
it: Annuncia il livello corrente del cursore del potenziometro della riproduzione

source: Reports the current level of recording's slider
ar: يبين المستوى الحالي لشريط تمرير التسجيل
it: Annuncia il livello corrente del cursore del potenziometro della registrazione

source: Reports the current playback speed level
ar: يبين مستوى سرعة التشغيل الحالية
it: Annuncia il livello di velocità di riproduzione corrente

source: Display add-on user manual
ar: عرض دليل المستخدم للإضافة
it: Visualizza il manuale utente dell'estensione

source: Display audacity guide
ar: عرض دليل audacity
it: Mostra la guida di Audacity

source: Launch command shell
ar: تشغيل الأوامر
it: Avvia la shell dei comandi

source: Display shell scripts's list
ar: عرض قائمة الإختصارات
it: Visualizza l'elenco degli script della shell

source: (command: %s)
ar: (الأوامر: %s)
it: (comando: %s)

source: Report automaticaly selection's changes
ar: الإبلاغ عن تغييرات التحديد التلقائي
it: Segnala automaticamente le modifiche alla selezione

source: Don't report automaticaly selection change
ar: لا تعلن عن تغيير التحديد تلقائيًا
it: Non segnalare automaticamente le modifiche alla selezione

source: Not in tracks view
ar: ليس في عرض المسارات
it: Non nella visualizzazione tracce

source: record button pressed
ar: الضغط على زر التسجيل
it: pulsante di registrazione premuto

source: play button pressed
ar: الضغط على زر التشغيل
it: pulsante di riproduzione premuto

source: Pause button pressed
ar: تم الضغط على زر الإيقاف المؤقت
it: Pulsante Pausa premuto

source: No button pressed
ar: تم الضغط على أي زر
it: Nessun pulsante premuto

source: playback speed: %s
ar: سرعة التشغيل: %s
it: velocità di riproduzione: %s

source: Please wait ...
ar: أرجو الإنتظار ...
it: Attendere prego ...

source: Error: Add-on user manual is not found
ar: خطأ: لم يتم العثور على دليل المستخدم للإضافة
it: Errore: il manuale utente del componente aggiuntivo non è stato trovato

source: Error: audacity guide is not found
ar: خطأ: لم يتم العثور على دليل البرنامج
it: Errore: la guida di Audacity non è stata trovata

source: Shell's scripts
ar: قائمة الإختصارات
it: Scripts della Shell

source: scripts:
ar: الإختصارات

source: &Run script
ar: تن&فيذ الأمر
it: &Esegui script

source: Options
ar: الخيارات
it: Opzioni

source: Use space bar and Enter keys to press button
ar: استخدم شريط المسافة وأدخل المفاتيح للضغط على الزر
it: Utilizza la barra spaziatrice e i tasti Invio per premere il pulsante

source: Report toolbars's name
ar: الإبلاغ عن اسم أشرطة الأدوات
it: Annuncia il nome delle barre degli strumenti

source: EnhancedAnnouncement of edit spin boxes
ar: الإعلان المحسن عن تحرير صناديق الدوران
it: Annuncio avanzato della modifica delle caselle di selezione

source: Update
ar: تحديث
it: Aggiorna

source: Automatically check for &updates
ar: البحث عن التحديثات تلقائيا
it: Verifica automaticamente la presenza di &aggiornamenti

source: Update also release versions to &developpement versions
ar: تحديث نسخة الت&طوير
it: Aggiorna anche le versioni di rilascio alle &versioni di sviluppo

source: &Check for update
ar: ال&بحث عن التحديث
it: &Ricerca aggiornamenti

source: View &history
ar: &عرض السجل
it: Visualizza &cronologia

source: Settings
ar: الإعدادات
it: Impostazioni

source: The update is not compatible with this version of NVDA. Minimum NVDA version: {minYear}{minMajor}, last tested: {testedYear}.{testedMajor}.
ar: التحديث غير متوافق مع هذا الإصدار من NVDA. الحد الأدنى من إصدار NVDA: {minYear} {minMajor} ، آخر اختبار: {testingYear}. {testingMajor}.

source: Downloading {name}
ar: تنزيل {name}
it: Download di {name}

source: Error downloading update for {name}.
ar: خطأ في تنزيل التحديث ل {name}.
it: Errore durante il download dell'aggiornamento per {name}.

source: Cannot update {name} - missing file or invalid file format
ar: لا يمكن تحديث {name} - ملف مفقود أو تنسيق ملف غير صالح
it: Impossibile aggiornare {name} - file mancante o formato file non valido

source: Updating
ar: جارٍ التحديث
it: In aggiornamento

source: Please wait while the add-on is being updated.
ar: يرجى الانتظار بينما يتم تحديث الوظيفة الإضافية.
it: Attendi mentre il componente aggiuntivo viene aggiornato.

source: Failed to update {name} add-on
ar: فشل تحديث الوظيفة الإضافية {name}
it: Impossibile aggiornare il componente aggiuntivo {name}

source: {summary} - update
ar: {summary} - التحديث
it: {summary} - aggiornamento

source: The service is temporarily under maintenance. Please, try again later.
ar: الخدمة تحت الصيانة بشكل مؤقت. الرجاء معاودة المحاولة في وقت لاحق.
it: Il servizio è momentaneamente in manutenzione. Per favore riprova più tardi.

source: New version available, version %s. Do you want download it now?
ar: يتوفر إصدار جديد ، الإصدار %s. هل تريد تنزيله الآن؟

source: You are up-to-date. %s is the latest version.
ar: %s هو أحدث إصدار حتى الآن؟
it: Sei aggiornato. %s è l'ultima versione.

source: Oops! There was a problem checking for updates. Please retry later
ar: يا الله! حدثت مشكلة أثناء التحقق من التحديثات. يرجى إعادة المحاولة لاحقًا
it: Ops! Si è verificato un problema durante il controllo degli aggiornamenti. Si prega di riprovare più tardi

source: &Yes
ar: &نعم
it: &Sì

source: &No
ar: &لا

source: &Later
ar: &في وقت لاحق
it: &Più tardi

source: Wha&t's new
ar: ما ال&جديد
it: Novità

source: This add-on adds extra functionality when working with Audacity * a script to report audio position, * a script to report start and end of selection, * a script to announce the state of the "Pause", "Play" and "record" buttons, * automatic audio position changes report , * automatic selection changes report (can be disabled), * timer control editting support, * use of spacebar to press a button, * script to report playback/recording peak level, * script to report playback/record slider level, * script to report playback speed, * script to display add-on user manual, * script to display audacity guide written by David Bailes. This addon's version has been tested with audacity 3.1, 3.0 and 2.4.2. Previous versions of Audacity are not supported.
it: Questo componente aggiuntivo aggiunge funzionalità extra quando si lavora con Audacity\n \n * uno script per segnalare la posizione dell'audio,\n * uno script per segnalare l'inizio e la fine della selezione,\n * uno script per annunciare lo stato dei pulsanti "Pausa", "Riproduci" e "Registra",\n * rapporto sulle modifiche automatiche della posizione dell'audio ,\n * rapporto sulle modifiche alla selezione automatica (può essere disabilitato),\n * supporto per la modifica del'area di controllo del tempo,\n * uso della barra spaziatrice per premere un pulsante,\n * script per segnalare il livello di picco di riproduzione/registrazione,\n * script per segnalare il livello del cursore del potenziometro di riproduzione/registrazione,\n * script per segnalare la velocità di riproduzione,\n * script per visualizzare il manuale utente del componente aggiuntivo,\n * script per visualizzare la guida di Audacity scritta da David Bailes.\n \n \n La versione di questo componente aggiuntivo è stata testata con audacity 3.1, 3.0 e 2.4.2.\n Le versioni precedenti di Audacity non sono supportate.\n

source: Are you sure you don't want to keep the current add-on configuration settings?
it: Sei sicuro di non voler mantenere le attuali impostazioni di configurazione del componente aggiuntivo?

source: The configuration file of the add-on contains errors. The configuration has been reset to factory defaults
it: Il file di configurazione del componente aggiuntivo contiene errori. La configurazione è stata ripristinata alle impostazioni di fabbrica

source: Warning
it: Avvertimento

source: The update is not compatible with this version of NVDA. Minimum NVDA version: {minYear}.{minMajor}, last tested: {testedYear}.{testedMajor}.
it: L'aggiornamento non è compatibile con questa versione di NVDA. Versione NVDA minima: {minYear}.{minMajor}, ultimo test: {testedYear}.{testedMajor}.

source: New version%s is available. Do you want to download it now?
it: È disponibile la nuova versione%s. vuoi scaricarla adesso?
